//#include <iostream>
//using namespace std;
//
//// 백준 문제 풀이
//// 날짜		: 2023. 06. 08. 목
//// 문제 번호	: #2193 
//// 문제 이름	: 이친수
//// 알고리즘	: DP
//// 시간복잡도: O()
//
//int N;
//long long D[100];
//
//int main()
//{
//	ios_base::sync_with_stdio(false);
//	cin.tie(NULL);
//
//	cin >> N;
//
//	// D[i] = D[i-1] + D[i-2] ??
//	// D[1] = 1
//	// D[2] = 1
//
//	// i = 5
//	// 10000, 10010, 10100, 10010, 10101
//	// i = 4
//	// 1000, 1001, 1010 <- 뒤에 0 붙이면(1은 안 되는 경우 있음) -> 10000, 10010, 10100
//	// i = 3
//	// 100, 101 <- 뒤에 01 붙이면(00, 10 은 i=4에서 만족함) -> 10010, 10101
//
//	D[1] = D[2] = 1;
//	for (int i = 3; i <= N; i++)
//	{
//		D[i] = D[i - 1] + D[i - 2];
//	}
//
//	cout << D[N];
//
//	return 0;
//}